---
kind: method
id: M:Autodesk.Revit.DB.SchedulableField.op_Equality(Autodesk.Revit.DB.SchedulableField,Autodesk.Revit.DB.SchedulableField)
source: html/4aab10ab-accb-bd8d-f322-c7275853dd49.htm
---
# Autodesk.Revit.DB.SchedulableField.op_Equality Method

Determines whether two SchedulableField are the same.

## Syntax (C#)
```csharp
public static bool operator ==(
	SchedulableField first,
	SchedulableField second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.SchedulableField`) - The first SchedulableField.
- **second** (`Autodesk.Revit.DB.SchedulableField`) - The second SchedulableField.

## Returns
True if the SchedulableField are the same, otherwise false.